Revit 2024 API
BuiltInFailures.RoofFailures Class
 Failures about Roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class RoofFailures
Visual Basic
Public NotInheritable Class RoofFailures
Visual C++
public ref class RoofFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RoofFailures
See Also
BuiltInFailures.RoofFailures Members
Autodesk.Revit.DB Namespace